{
	"class":[
      {
         "Course_Number":"CIST 1305",
         "Title": "Program Design and Development",
         "Description":"An introductory course that provides problem solving and programming concepts for those that develop user applications. An emphasis is placed on developing logic, troubleshooting, and using tools to develop solutions.   Topics include: problem solving and programming concepts, structured programming, the four logic structures, file processing concepts, and arrays.",
         "Credit_Hours":"3",
         "PreReq_Required":"No"
      },
	  {
         "Course_Number":"CIST 1520",
         "Title":"Scripting Technologies",
         "Description":"Students learn how to use the features and structure of a client-side scripting language, explore the features on server side scripting and develop professional web applications that include special effects, interactive, dynamic, validated, and secure forms.",
         "Credit_Hours":"3",
         "PreReq_Required":"Yes, CIST 1510"
      },
      
	  {
         "Course_Number":"CIST 1306",
         "Title":"Programming Foundations-Swift",
         "Description":"Learn key computing concepts, building a solid foundation in programming with Swift. Learn about the impact of computing and apps on society, economies, and cultures while exploring iOS app development, including the app design process: brainstorming, planning, prototyping, and evaluating an app design of their own.",
         "Credit_Hours":"3",
         "PreReq_Required":"No"
      },
	  
	  {
         "Course_Number":"CIST 2921",
         "Title":"IT Analysis Design and Project Mgt",
         "Description":"IT Analysis, Design, and Project Management will provide a review and application of systems life cycle development methodologies and project management. Topics include: Systems planning, systems analysis, systems design, systems implementation, evaluation, and project management.",
         "Credit_Hours":"4",
         "PreReq_Required":"Yes, CIST 1305"
      }
	  ]
}
